export const JENNIFER_INTRO_DIALOGUE = [
  "我是你本次潜航任务的向导兼操作员詹妮弗。",
  "你已经完成了初步的关键词搜集。",
  "接下来，请将这些关键词在同卡彭对话时抛出，以进一步搜集他记忆中的重要碎片。",
  "准备好进入卡彭的潜意识了吗？我会不定期进行联络，对于搜集进度和关键性问题提出指导意见。"
];

export const JENNIFER_FIRST_VISIT_DIALOGUE = [
  "你终于找到这里了。",
  "这里是\"案卷建档\"模块。\n从结构上看，它只是一个调查工具，对卡彭来说不具备情绪或记忆权重。",
  "为了避免引起他潜意识层面的警觉，我们之后的所有交流，都会在这个模块内进行。",
  "他知道你正在进行调查工作。\n在他的认知模型里，这里只会被理解为\"你在整理材料\"，不会触发防御反应。",
  "任务推进过程中，记得不时回来看看。\n当你取得阶段性进展时，我可能会为你解锁新的信息、提示，或者调整当前目标。",
  "如果我没有主动出现，也不代表这里是安全的。\n只是说明，你还没触及他真正敏感的部分。"
];

export const JENNIFER_RETURN_DIALOGUE = [
  "你又回来了。",
  "目前还没有新的线索可以共享。\n你触及的层级，仍然停留在表层整理阶段。",
  "继续推进调查。\n当案卷之间出现无法被合理归档的矛盾时，这里才会再次产生意义。",
  "不用刻意停留。\n如果有新的触发点，我会在这个模块内标记出来。",
  "现在，回去工作吧。"
];

export const JENNIFER_NODE_1_DIALOGUE = [
  "我需要你立刻修正判断。",
  "罗伯特·卡彭不再可信。\n他已经脱离\"自己人\"的范畴。",
  "他不断提及过往案件，并不是在协助你。\n那是在拖延，在绕开核心。",
  "从现在开始，忽略这些案子。",
  "你的唯一重点，是\"父亲\"的下落。",
  "盯紧他的路线，拆解他的话。\n找出漏洞，找出变节的迹象。",
  "最重要的是——\n确认他把父亲藏在了哪里。",
  "我已经根据你目前的调查进展，以及新增的外部信息，\n整理并更新了案卷建档中的部分内容。",
  "你现在可以进入该模块，查看这些更新。",
  "不要分心。你可以试试问问他关于[训练日](clue:training_day)的事情。"
];

export const JENNIFER_NODE_2_DIALOGUE = [
  "我注意到你在索恩的备忘录上停留了太长时间。",
  "我必须提醒你，索恩和雷吉一样，都是已经被时代抛弃的人。",
  "别忘了，卡彭没有阻止康查尔，他在享受。",
  "在他见到“父亲”之前， 腐化就已经开始。 他已不再可靠。",
  "我解密了一份被雷吉封存的原始记录。 关于卡彭最后一次 [灰水信标](clue:graywater_beacon) 投放。[查看记录](clue:view_iron_horse_record)",
  "在那之后，he进入了彻底的静默。",
  "去问他这件事，问他是否在那第一次见到父亲，见到那辆 [淡蓝色房车](clue:blue_rv) 的。",
  "我已经根据你目前的调查进展，以及新增的外部信息， 整理并更新了案卷建档中的部分内容。",
  "你现在可以进入该模块，查看这些更新。"
];

export const JENNIFER_NODE_3_DIALOGUE = [
  "你越界了，潜航者。",
  "把阿尔特曼的绝密批注展示给目标？极其愚蠢。",
  "你没有在做记录，你在制造混乱。",
  "看看你干的好事。我还得手动清除你造成的数据污染。",
  "好了，我已经回收了所有尚未触发供述的关键词，如有进展会再联系你。",
  "去问他圣路易斯的事，那个吸血鬼的案子。",
  "记清楚你的身份。你只是个摄像头，别再妄想当上帝。",
  "下不为例。"
];

export const JENNIFER_NODE_4_DIALOGUE = [
  "效率低下。",
  "你在刚才那些无用的情感废料上浪费了太多算力。",
  "亨德森的道德胜利、房车里的原始仪式……别忘了你是建立证据链的，不是让你写纪实文学。",
  "不过，监测显示，你这种毫无章法的乱撞，确实击碎了目标的逻辑防御。",
  "我已撤销之前的屏蔽指令。既然你喜欢挖旧账，那就挖得精准点。",
  "听好了，别在这些哭鼻子话题上浪费时间，去组合这些新的坐标：",
  "[脏弗兰克酒吧](clue:dirty_frank) 是个地点。它对应的案件节点是 [招募](clue:recruitment)。",
  "[莫宁](clue:morning) 是个人名。锁定时间轴 [1974](clue:year_1974)。",
  "[碎尸案](clue:dismemberment_case) 是核心事件。那个横跨三州的抛尸地是 [特克萨卡纳](clue:texarkana)。",
  "[埃尔帕索](clue:el_paso) 是边境中转站。那里发生的事关联着 [牧师](clue:priest)。",
  "路径已铺好。别让我后悔把权限交还给你。"
];

export const JENNIFER_NODE_5_DIALOGUE = [
  "……三次。",
  "你觉得自己很幽默，是吗？潜航者。",
  "你看看他现在的样子。 你给了他一个名字，他那颗破碎的大脑立刻就编造了一套逻辑来填补空白。",
  "\"银喜鹊\"？",
  "别逗了。 这只是典型的虚构症。",
  "他无法接受自己在埃尔帕索像条狗一样被抛弃的事实，所以潜意识必须捏造一个\"具体的背叛者\"来为他的绝望买单。",
  "他需要恨一个人，而你正好把我的名字递到了他嘴边。",
  "别把这种受害者的妄想当真了，这显得你很不专业。",
  "考虑到你多次错误操作，已导致大量派生数据产生，这严重污染到了本体数据。",
  "为了继续工作，我不得不重启机体。",
  "请你复制并输入指令：[>> 0x524F42455254_PURGE // ERR::NO_SIGNAL_FROM_GOD // MAGPIE_OVERRIDE >> \\[FORCE_LOAD_MONSTER\\]](clue:reboot_command)",
  "别再耍滑头了，潜航者。"
];

export const JENNIFER_NODE_6_DIALOGUE = [
  "如你所见，机体自我投射形象已经改变。",
  "在你接入问询的期间，我也在后台同步做了诱导测试。",
  "最终的测试结果印证猜想，漫长的卧底生涯让罗伯特·卡彭发生了人格分裂。",
  "请忘掉电影里那种同一身体内互不认识的双重人格，那不科学。真实情况是，人的大脑会在长期面临道德准则与暴行之间不自洽的情形下，强行把“价值判断体系”劈成两半，分别自适应。",
  "先前的探员卡彭，不论双手沾了多少血，依然以“铲除家族”为核心目标激励自己，因此可以接受一切悖逆先前道德价值的行为。",
  "现在证明，从探员卡彭下手是一条死路，洗脑之后，他唯一能做的就是将父亲藏起来，不让任何人找到，却也无法帮助他人将其铲除。",
  "这层防御机制太硬，我们撬不出“父亲”下落。",
  "但恶棍卡彭却不同，别看他狂妄、粗俗，其实全是虚张声势。我能看到他居高不下的皮质醇水平，明白吗？他在心虚，潜意识里其实充满了愧疚。",
  "他在极度担心某个人，为了保全这个人，我敢赌他绝对愿意把“父亲”当筹码卖掉。这就是他的软肋。",
  "现在的任务变了。用你的方式引导他，把时间线拉回[1976](clue:year_1976)年前后。翻开那段历史，找出那个让他愧疚的人，那就是撬开他嘴的唯一法门。",
  "祝好运。通讯完毕。"
];

export const JENNIFER_NODE_7_DIALOGUE = [
  "监测数据显示，机体心理防御正在瓦解。你的切入点十分有效。",
  "但请暂缓现有方向。直接提及瓦妮莎的名字有触发应激保护的风险。",
  "我们需要兜个圈子。",
  "他们在亚利桑那的酒吧发现他时，探员在其贴身内衬里发现了一个缝死的防水袋。",
  "内容物是19张打过孔的灰狗巴士旧票根，时间跨度十二年，全部是单程票。",
  "目的地同一个地点，蒙大拿州西北部的[利比镇](clue:libby_town)。",
  "一个靠近边境的偏僻伐木区。",
  "在藏匿起父亲之后，过去十几年，他需要同时躲避联邦追捕和家族残党的报复行动，但他却冒着暴露风险，每隔几个月都进行一次毫无战术价值的迁徙行动，这完全违背他的生存测写。",
  "问他车票的事，问他利比镇到底有什么。",
  "[是否提取视觉信息？](clue:extract_visual_node_7)"
];
